private-rag-aws-gpu.org
#+TITLE: Private RAG AWS GPU Deployment - Live-Scripting Workflow
#+AUTHOR: Andreas Wittmann
#+DATE: 2025-11-18
#+OPTIONS: toc:t  H:4 num:t
#+LATEX_OPTIONS: toc:nil
#+STARTUP: overview
#+SETUPFILE: aw-org-html-themes/setup/theme-readtheorg-local.setup
#+Include: "latex_setup.org"
#+LATEX_COMPILER: xelatex

#+LATEX: \newline
#+LATEX: \newline

* Summary
/This document outlines the deployment of RagFlow, an open-source RAG platform, on Ubuntu 24.04 with GPU acceleration. Using the live-scripting methodology, it contains executable code blocks that ensure reproducible infrastructure setup. It covers Terraform infrastructure provisioning with pre-configured Deep Learning AMI, Docker containerization, and RagFlow deployment with GPU support./
#+LATEX: \newline 

- *HTML Version:* [[file:private-rag-aws-gpu.html][private-rag-aws-gpu.html]]
- *PDF Version:* [[file:private-rag-aws-gpu.pdf][private-rag-aws-gpu.pdf]]
- *GitHub:* https://github.com/andreaswittmann/private-rag/tree/main


* Building Privacy-Focused RAG Platform with GPU Acceleration

** Project Overview

This project uses the live-scripting methodology to create an example configuration of the open-source project RagFlow on Ubuntu 24.04 with GPU support. Live-scripting represents an intermediate approach between manual command-line work and fully automated CI/CD pipelines, enabling the development of documented, shareable, and reproducible solutions.

Using Infrastructure as Code methods with Terraform, an AWS environment with GPU-enabled EC2 instance running Ubuntu 24.04 is established as a platform for RagFlow installation. The Deep Learning AMI comes pre-configured with NVIDIA drivers and CUDA toolkit, eliminating manual GPU setup. The example demonstrates all necessary configuration and software tool installations required for the project. To test the installation a sample use case shows the how an document is ingested and queried using RagFlow UI. A section in the end outlines the steps for removing the infrastructure completely.

** Live-Scripting Methodology

The deployment uses live-scripting methodology to transform static documentation into executable workflows. Code blocks can be executed step by step directly in Emacs (F4 key) or be copied to any terminal, creating a bridge between documentation and execution.

Based on the [live-scripting methodology](https://github.com/andreaswittmann/live-scripting), this approach provides:

- Executable documentation with current and functional code blocks
- Multi-format publishing from single Orgmode File to HTML and PDF
- Reproducible deployments with consistent infrastructure setup
- Support of version control through plain-text format

*** Implementation Options

**** Emacs Users
Configure live-scripting with this Emacs Lisp function:

#+begin_src emacs-lisp
# Listing: Emacs Lisp function for sending current line or region to vterm
;; Put this to your  ~/.emacs.d/personal/my_custom.el or similar file and load it.

(defun my-select-current-line ()
  "Selects the current line, including the NEXT-LINE char at the end"
  (interactive)
  (move-beginning-of-line nil)
  (set-mark-command nil)
  (move-end-of-line 2)
  (move-beginning-of-line nil)
  (setq deactivate-mark nil))

(defun send-line-to-vterm ()
  "Send region if active, or current line to vterm buffer. Then move to next line."
  (interactive)
  (if (region-active-p)
      (send-region "*vterm*" (region-beginning) (region-end))
    (my-select-current-line)
    (send-region "*vterm*" (region-beginning) (region-end)))
  (deactivate-mark))
#+end_src

**** Non-Emacs Users
Copy code blocks to any terminal, 


** Expected Deployment Outcome

The workflow produces a functioning HTTPS-enabled RagFlow instance on AWS with GPU acceleration, capable of document processing and RAG-based AI responses with full user control and enhanced performance.

* Foundation & Prerequisites

** Environment Setup

These steps establish the development environment and validate prerequisites.

