private-rag-aws-gpu.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-20 Thu 20:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Private RAG AWS GPU Deployment - Live-Scripting Workflow</title>
<meta name="author" content="Andreas Wittmann" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="aw-org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="aw-org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Private RAG AWS GPU Deployment - Live-Scripting Workflow</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org513740f">1. Summary</a></li>
<li><a href="#orgd983846">2. Building Privacy-Focused RAG Platform with GPU Acceleration</a>
<ul>
<li><a href="#org1d21a2d">2.1. Project Overview</a></li>
<li><a href="#orgc531282">2.2. Live-Scripting Methodology</a>
<ul>
<li><a href="#org3177ea5">2.2.1. Implementation Options</a>
<ul>
<li><a href="#org558536c">2.2.1.1. Emacs Users</a></li>
<li><a href="#orgfe70640">2.2.1.2. Non-Emacs Users</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb2b28c4">2.3. Expected Deployment Outcome</a></li>
</ul>
</li>
<li><a href="#org31d293b">3. Foundation &amp; Prerequisites</a>
<ul>
<li><a href="#org67ffd7a">3.1. Environment Setup</a>
<ul>
<li><a href="#org762b61a">3.1.1. Bootstrapping with Cloning private-rag Repository</a></li>
<li><a href="#org2a23f2b">3.1.2. Setting the Project Foundation</a></li>
</ul>
</li>
<li><a href="#orgd7750e9">3.2. Summary</a></li>
</ul>
</li>
<li><a href="#org10bedf3">4. Infrastructure as Code</a>
<ul>
<li><a href="#org03996ed">4.1. SSH Key Generation for Secure Access</a></li>
<li><a href="#org0d2fcaa">4.2. Terraform Configuration and Planning</a></li>
<li><a href="#org2f5c9e0">4.3. Infrastructure Deployment Planning</a></li>
<li><a href="#org4cf74ea">4.4. Infrastructure Deployment Execution</a></li>
<li><a href="#org7db99b9">4.5. SSH Configuration for Easy Access</a></li>
<li><a href="#org510a74b">4.6. GPU Instance Selection and Upgrading</a>
<ul>
<li><a href="#org9fbcd5d">4.6.1. Recommended GPU EC2 Instance Types for RAG Workloads</a>
<ul>
<li><a href="#orgf6612ec">4.6.1.1. Recommendations</a></li>
</ul>
</li>
<li><a href="#orgd8d1d90">4.6.2. Upgrading to a Different GPU Instance Type with Terraform</a></li>
</ul>
</li>
<li><a href="#org30c8e7c">4.7. Summary</a></li>
</ul>
</li>
<li><a href="#org7ef261d">5. GPU Verification</a></li>
<li><a href="#org9abda6e">6. Development Environment Setup</a>
<ul>
<li><a href="#org6d86636">6.1. Complete Docker Engine and Tools Installation</a>
<ul>
<li><a href="#orgf0c4708">6.1.1. Docker Engine Installation and Tools</a></li>
<li><a href="#org3f6c0f8">6.1.2. Python Development Tools Installation</a></li>
<li><a href="#orgd9bb34e">6.1.3. Development Environment Summary</a></li>
</ul>
</li>
<li><a href="#orgad58f50">6.2. Summary</a></li>
</ul>
</li>
<li><a href="#org852abf4">7. Core RagFlow Deployment</a>
<ul>
<li><a href="#orgfdaf97f">7.1. Basic Ragflow Setup</a></li>
<li><a href="#org27bfe0d">7.2. HTTPS Setup with Self-Signed Certificate</a>
<ul>
<li><a href="#org39644d2">7.2.1. Step 1: Generate Self-Signed SSL Certificate**</a></li>
<li><a href="#org3faa15f">7.2.2. Step 2: Modify Nginx Configuration**</a></li>
<li><a href="#org9fbfb2e">7.2.3. Step 3: Update Docker Compose Configuration</a></li>
<li><a href="#orgf3fa0bd">7.2.4. Step 4: Restart RAGFlow Services</a></li>
<li><a href="#org8612421">7.2.5. Step 5: Test HTTPS Access</a></li>
</ul>
</li>
<li><a href="#orgbfa0956">7.3. Use Case: Access RagFlow via SSH-Tunnel</a></li>
<li><a href="#org0adc4f3">7.4. Summary</a></li>
</ul>
</li>
<li><a href="#org38c17d4">8. Advanced Features - Document Processing</a>
<ul>
<li><a href="#org75ea563">8.1. Document Ingestion and Processing</a>
<ul>
<li><a href="#org75ba70b">8.1.1. Upload Documents</a></li>
<li><a href="#org527ec3a">8.1.2. Configure Knowledge Base</a></li>
<li><a href="#org1952bda">8.1.3. Test RAG Queries</a></li>
</ul>
</li>
<li><a href="#org6e8685d">8.2. Summary</a></li>
</ul>
</li>
<li><a href="#org123bb69">9. Infrastructure Cleanup</a>
<ul>
<li><a href="#org6135eba">9.1. Stop RagFlow Services (Optional)</a></li>
<li><a href="#org68975c9">9.2. Terminate GPU EC2 Instance with Terraform</a></li>
<li><a href="#orge40dac1">9.3. Clean Up Local SSH Configuration</a></li>
<li><a href="#org9c8c201">9.4. Clean Up Terraform State Files</a></li>
<li><a href="#orgfce4a6f">9.5. Verify Complete Cleanup</a></li>
<li><a href="#orgd064333">9.6. Summary</a></li>
</ul>
</li>
<li><a href="#org37103f2">10. Appendix: Live-Cycle Operations</a></li>
<li><a href="#orgce90ced">11. End</a></li>
</ul>
</div>
</div>
<div id="outline-container-org513740f" class="outline-2">
<h2 id="org513740f"><span class="section-number-2">1.</span> Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>This document outlines the deployment of RagFlow, an open-source RAG platform, on Ubuntu 24.04 with GPU acceleration. Using the live-scripting methodology, it contains executable code blocks that ensure reproducible infrastructure setup. It covers Terraform infrastructure provisioning with pre-configured Deep Learning AMI, Docker containerization, and RagFlow deployment with GPU support.</i>
</p>
<ul class="org-ul">
<li><b>HTML Version:</b> <a href="private-rag-aws-gpu.html">private-rag-aws-gpu.html</a></li>
<li><b>PDF Version:</b> <a href="private-rag-aws-gpu.pdf">private-rag-aws-gpu.pdf</a></li>
<li><b>GitHub:</b> <a href="https://github.com/andreaswittmann/private-rag/tree/main">https://github.com/andreaswittmann/private-rag/tree/main</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd983846" class="outline-2">
<h2 id="orgd983846"><span class="section-number-2">2.</span> Building Privacy-Focused RAG Platform with GPU Acceleration</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1d21a2d" class="outline-3">
<h3 id="org1d21a2d"><span class="section-number-3">2.1.</span> Project Overview</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This project uses the live-scripting methodology to create an example configuration of the open-source project RagFlow on Ubuntu 24.04 with GPU support. Live-scripting represents an intermediate approach between manual command-line work and fully automated CI/CD pipelines, enabling the development of documented, shareable, and reproducible solutions.
</p>

<p>
Using Infrastructure as Code methods with Terraform, an AWS environment with GPU-enabled EC2 instance running Ubuntu 24.04 is established as a platform for RagFlow installation. The Deep Learning AMI comes pre-configured with NVIDIA drivers and CUDA toolkit, eliminating manual GPU setup. The example demonstrates all necessary configuration and software tool installations required for the project. To test the installation a sample use case shows the how an document is ingested and queried using RagFlow UI. A section in the end outlines the steps for removing the infrastructure completely.
</p>
</div>
</div>
<div id="outline-container-orgc531282" class="outline-3">
<h3 id="orgc531282"><span class="section-number-3">2.2.</span> Live-Scripting Methodology</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The deployment uses live-scripting methodology to transform static documentation into executable workflows. Code blocks can be executed step by step directly in Emacs (F4 key) or be copied to any terminal, creating a bridge between documentation and execution.
</p>

<p>
Based on the [live-scripting methodology](<a href="https://github.com/andreaswittmann/live-scripting">https://github.com/andreaswittmann/live-scripting</a>), this approach provides:
</p>

<ul class="org-ul">
<li>Executable documentation with current and functional code blocks</li>
<li>Multi-format publishing from single Orgmode File to HTML and PDF</li>
<li>Reproducible deployments with consistent infrastructure setup</li>
<li>Support of version control through plain-text format</li>
</ul>
</div>
<div id="outline-container-org3177ea5" class="outline-4">
<h4 id="org3177ea5"><span class="section-number-4">2.2.1.</span> Implementation Options</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
<div id="outline-container-org558536c" class="outline-5">
<h5 id="org558536c"><span class="section-number-5">2.2.1.1.</span> Emacs Users</h5>
<div class="outline-text-5" id="text-2-2-1-1">
<p>
Configure live-scripting with this Emacs Lisp function:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"># Listing: Emacs Lisp function for sending current line or region to vterm
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Put this to your  ~/.emacs.d/personal/my_custom.el or similar file and load it.</span>

(<span style="color: #0000FF; font-weight: bold;">defun</span> <span style="color: #006699;">my-select-current-line</span> ()
  <span style="color: #036A07;">"Selects the current line, including the NEXT-LINE char at the end"</span>
  (<span style="color: #0000FF; font-weight: bold;">interactive</span>)
  (move-beginning-of-line nil)
  (set-mark-command nil)
  (move-end-of-line 2)
  (move-beginning-of-line nil)
  (<span style="color: #0000FF; font-weight: bold;">setq</span> deactivate-mark nil))

(<span style="color: #0000FF; font-weight: bold;">defun</span> <span style="color: #006699;">send-line-to-vterm</span> ()
  <span style="color: #036A07;">"Send region if active, or current line to vterm buffer. Then move to next line."</span>
  (<span style="color: #0000FF; font-weight: bold;">interactive</span>)
  (<span style="color: #0000FF; font-weight: bold;">if</span> (region-active-p)
      (send-region <span style="color: #008000;">"*vterm*"</span> (region-beginning) (region-end))
    (my-select-current-line)
    (send-region <span style="color: #008000;">"*vterm*"</span> (region-beginning) (region-end)))
  (deactivate-mark))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe70640" class="outline-5">
<h5 id="orgfe70640"><span class="section-number-5">2.2.1.2.</span> Non-Emacs Users</h5>
<div class="outline-text-5" id="text-2-2-1-2">
<p>
Copy code blocks to any terminal, 
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb2b28c4" class="outline-3">
<h3 id="orgb2b28c4"><span class="section-number-3">2.3.</span> Expected Deployment Outcome</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The workflow produces a functioning HTTPS-enabled RagFlow instance on AWS with GPU acceleration, capable of document processing and RAG-based AI responses with full user control and enhanced performance.
</p>
</div>
</div>
</div>
<div id="outline-container-org31d293b" class="outline-2">
<h2 id="org31d293b"><span class="section-number-2">3.</span> Foundation &amp; Prerequisites</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org67ffd7a" class="outline-3">
<h3 id="org67ffd7a"><span class="section-number-3">3.1.</span> Environment Setup</h3>
<div class="outline-text-3" id="text-3-1">
<p>
These steps establish the development environment and validate prerequisites.
</p>
</div>
