private-rag-aws-gpu.org
*** Bootstrapping with Cloning private-rag Repository

This creates a Lab directory and clones the private-rag repository for subsequent live-scripting consumption with Emacs.

#+begin_src bash
# Listing: Cloning private-rag repository
cd ~; pwd
export BASE_DIR=~/Labs
echo $BASE_DIR
mkdir -p $BASE_DIR
cd $BASE_DIR
pwd
git clone https://github.com/andreaswittmann/private-rag.git

# open in Emacs: ~/$(whoami)/Labs/private-rag/private-rag-aws-gpu.org

#+end_src

To fowllow along usnig the live-scripting methodology, open the file ~/$(whoami)/Labs/private-rag/private-rag-aws-gpu.org in Emacs.

*** Setting the Project Foundation

This establishes the base project directory and validates AWS network prerequisites.


#+begin_src bash
# Listing: Project environment setup

bash
PROJECT_DIR="~/$(whoami)/Labs/private-rag"
cd "$PROJECT_DIR"
pwd
ls -la

# Set AWS profile for this session
export AWS_PROFILE=lab-a-north
echo $AWS_PROFILE

## create default VPC if it does not exist
aws ec2 create-default-vpc
## check if the default vpc is created
aws ec2 describe-vpcs --filters "Name=isDefault,Values=true" --query "Vpcs[0].VpcId" --output text

# Ensuring AWS access and basic services availability
# Test basic AWS connectivity
aws s3 ls

# Verify AWS identity and permissions
aws sts get-caller-identity

# Verify SSH key is available for EC2 access
ls -la ~/.ssh/

# Validate required tools are installed
terraform --version

#+end_src

*Result:* Project environment is configured and AWS default VPC, AWS credentials and required tools are validated for infrastructure deployment.

** Summary

The foundation phase establishes the development environment by cloning the private-rag repository and setting the project foundation. AWS credentials are verified, default VPC created if needed, S3 access tested, STS identity confirmed, SSH keys validated, and required tools like Terraform checked. This groundwork enables reproducible infrastructure deployment through live-scripting methodology.

* Infrastructure as Code

** SSH Key Generation for Secure Access

This block creates dedicated SSH keypairs for EC2 instance access and stores the public key for Terraform.

#+begin_src bash
# Listing: SSH key generation for EC2 access
# Creating dedicated SSH keys for secure instance access

cd "$PROJECT_DIR"
pwd;
# Generate a new SSH key pair specifically for RagFlow GPU
ssh-keygen -t rsa -b 4096 -f ~/.ssh/ragflow-gpu_key -N ""
y
# Display the public key for use in Terraform variables
ls -la ~/.ssh/ragflow-gpu_key*
cat ~/.ssh/ragflow-gpu_key.pub

# Store public key in environment variable
export TF_VAR_SSH_PUBLIC_KEY="$(cat ~/.ssh/ragflow-gpu_key.pub)"
echo "SSH public key configured: $TF_VAR_SSH_PUBLIC_KEY"
#+end_src

*Result:* SSH keypair is generated and public key is exported for infrastructure provisioning.

** Terraform Configuration and Planning

This prepares the Terraform configuration files and validates the infrastructure setup for GPU-enabled instance.

#+begin_src bash
# Listing: Terraform environment preparation
# Setting up infrastructure configuration for GPU instance

cd "$PROJECT_DIR/terraform-gpu"
pwd
# Create terraform variables file with GPU configuration
cat > terraform.tfvars << EOF
# Generated tfvars file - $(date)
aws_region       = "eu-north-1"
instance_type    = "g4dn.xlarge"
root_volume_size = 100
root_volume_type = "gp3"
allowed_ip       = "0.0.0.0/0"
ssh_public_key   = "${TF_VAR_SSH_PUBLIC_KEY}"
ec2_name         = "EC2-RagFlow-GPU"
environment      = "development"
project          = "ragflow-gpu"
ssh_cidr_blocks  = ["0.0.0.0/0"]
EOF

# Review our configuration
cat terraform.tfvars

# Initialize Terraform
terraform init

# Format and validate our configuration
terraform fmt
terraform validate
#+end_src

*Result:* Terraform configuration is initialized and validated for GPU-enabled infrastructure deployment.

** Infrastructure Deployment Planning

This creates the deployment plan and reviews resource changes before applying them.

#+begin_src bash
# Listing: Terraform deployment planning
# Creating and reviewing the GPU infrastructure deployment plan

# Generate deployment plan
terraform plan -out=tfplan -var-file=terraform.tfvars

# Create human-readable plan
terraform show -json tfplan > tfplan.json
cat tfplan.json | jq > tfplan.pretty.json

# Review what resources will be created
echo "Resources to be created:"
cat tfplan.json | jq '.resource_changes[] | {address: .address, action: .change.actions[0]}'

# Summary of planned changes
cat tfplan.json | jq '.resource_changes | group_by(.change.actions[0]) | map({action: .[0].change.actions[0], count: length})'
#+end_src

*Result:* Deployment plan is generated and resource changes are reviewed for approval.

