private-rag-aws-gpu.html
<div id="outline-container-org762b61a" class="outline-4">
<h4 id="org762b61a"><span class="section-number-4">3.1.1.</span> Bootstrapping with Cloning private-rag Repository</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
This creates a Lab directory and clones the private-rag repository for subsequent live-scripting consumption with Emacs.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Cloning private-rag repository</span>

<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">BASE_DIR</span>=<span style="color: #008000;">"~/$(whoami)/Labs"</span>
mkdir -p $<span style="color: #BA36A5;">BASE_DIR</span>
<span style="color: #006FE0;">cd</span> $<span style="color: #BA36A5;">BASE_DIR</span>

git clone https://github.com/andreaswittmann/private-rag.git

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">open in Emacs: ~/$(whoami)/Labs/private-rag/private-rag-aws-gpu.org</span>

</pre>
</div>

<p>
To fowllow along usnig the live-scripting methodology, open the file ~/$(whoami)/Labs/private-rag/private-rag-aws-gpu.org in Emacs.
</p>
</div>
</div>
<div id="outline-container-org2a23f2b" class="outline-4">
<h4 id="org2a23f2b"><span class="section-number-4">3.1.2.</span> Setting the Project Foundation</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
This establishes the base project directory and validates AWS network prerequisites.
</p>


<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Project environment setup</span>

bash
<span style="color: #BA36A5;">PROJECT_DIR</span>=<span style="color: #008000;">"~/$(whoami)/Labs/private-rag"</span>
<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR"</span>
<span style="color: #006FE0;">pwd</span>
ls -la

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Set AWS profile for this session</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">AWS_PROFILE</span>=lab-a-north
<span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">AWS_PROFILE</span>

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">create default VPC if it does not exist</span>
aws ec2 create-default-vpc
<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">check if the default vpc is created</span>
aws ec2 describe-vpcs --filters <span style="color: #008000;">"Name=isDefault,Values=true"</span> --query <span style="color: #008000;">"Vpcs[0].VpcId"</span> --output text

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Ensuring AWS access and basic services availability</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test basic AWS connectivity</span>
aws s3 ls

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify AWS identity and permissions</span>
aws sts get-caller-identity

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify SSH key is available for EC2 access</span>
ls -la ~/.ssh/

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate required tools are installed</span>
terraform --version

</pre>
</div>

<p>
<b>Result:</b> Project environment is configured and AWS default VPC, AWS credentials and required tools are validated for infrastructure deployment.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd7750e9" class="outline-3">
<h3 id="orgd7750e9"><span class="section-number-3">3.2.</span> Summary</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The foundation phase establishes the development environment by cloning the private-rag repository and setting the project foundation. AWS credentials are verified, default VPC created if needed, S3 access tested, STS identity confirmed, SSH keys validated, and required tools like Terraform checked. This groundwork enables reproducible infrastructure deployment through live-scripting methodology.
</p>
</div>
</div>
</div>
<div id="outline-container-org10bedf3" class="outline-2">
<h2 id="org10bedf3"><span class="section-number-2">4.</span> Infrastructure as Code</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org03996ed" class="outline-3">
<h3 id="org03996ed"><span class="section-number-3">4.1.</span> SSH Key Generation for Secure Access</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This block creates dedicated SSH keypairs for EC2 instance access and stores the public key for Terraform.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: SSH key generation for EC2 access</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Creating dedicated SSH keys for secure instance access</span>

<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR"</span>
<span style="color: #006FE0;">pwd</span>;
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate a new SSH key pair specifically for RagFlow GPU</span>
ssh-keygen -t rsa -b 4096 -f ~/.ssh/ragflow-gpu_key -N <span style="color: #008000;">""</span>
y
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Display the public key for use in Terraform variables</span>
ls -la ~/.ssh/ragflow-gpu_key*
cat ~/.ssh/ragflow-gpu_key.pub

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Store public key in environment variable</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">TF_VAR_SSH_PUBLIC_KEY</span>=<span style="color: #008000;">"$(cat ~/.ssh/ragflow-gpu_key.pub)"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"SSH public key configured: $TF_VAR_SSH_PUBLIC_KEY"</span>
</pre>
</div>

<p>
<b>Result:</b> SSH keypair is generated and public key is exported for infrastructure provisioning.
</p>
</div>
</div>
<div id="outline-container-org0d2fcaa" class="outline-3">
<h3 id="org0d2fcaa"><span class="section-number-3">4.2.</span> Terraform Configuration and Planning</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This prepares the Terraform configuration files and validates the infrastructure setup for GPU-enabled instance.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Terraform environment preparation</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Setting up infrastructure configuration for GPU instance</span>

<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform-gpu"</span>
<span style="color: #006FE0;">pwd</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create terraform variables file with GPU configuration</span>
cat &gt; terraform.tfvars &lt;&lt; EOF
<span style="color: #0000ff; background-color: #EEF5FE;"># Generated tfvars file - $(date)</span>
<span style="color: #0000ff; background-color: #EEF5FE;">aws_region       = "eu-north-1"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">instance_type    = "g4dn.xlarge"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">root_volume_size = 100</span>
<span style="color: #0000ff; background-color: #EEF5FE;">root_volume_type = "gp3"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">allowed_ip       = "0.0.0.0/0"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">ssh_public_key   = "${TF_VAR_SSH_PUBLIC_KEY}"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">ec2_name         = "EC2-RagFlow-GPU"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">environment      = "development"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">project          = "ragflow-gpu"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">ssh_cidr_blocks  = ["0.0.0.0/0"]</span>
<span style="color: #0000ff; background-color: #EEF5FE;">EOF</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Review our configuration</span>
cat terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Initialize Terraform</span>
terraform init

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Format and validate our configuration</span>
terraform fmt
terraform validate
</pre>
</div>

<p>
<b>Result:</b> Terraform configuration is initialized and validated for GPU-enabled infrastructure deployment.
</p>
</div>
</div>
<div id="outline-container-org2f5c9e0" class="outline-3">
<h3 id="org2f5c9e0"><span class="section-number-3">4.3.</span> Infrastructure Deployment Planning</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This creates the deployment plan and reviews resource changes before applying them.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Terraform deployment planning</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Creating and reviewing the GPU infrastructure deployment plan</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate deployment plan</span>
terraform plan -out=tfplan -var-file=terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create human-readable plan</span>
terraform show -json tfplan &gt; tfplan.json
cat tfplan.json | jq &gt; tfplan.pretty.json

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Review what resources will be created</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Resources to be created:"</span>
cat tfplan.json | jq <span style="color: #008000;">'.resource_changes[] | {address: .address, action: .change.actions[0]}'</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Summary of planned changes</span>
cat tfplan.json | jq <span style="color: #008000;">'.resource_changes | group_by(.change.actions[0]) | map({action: .[0].change.actions[0], count: length})'</span>
</pre>
</div>

<p>
<b>Result:</b> Deployment plan is generated and resource changes are reviewed for approval.
</p>
</div>
</div>
