private-rag-aws-gpu.org
** Infrastructure Deployment Execution

This executes the Terraform plan to create the AWS infrastructure resources with GPU support.

#+begin_src bash
# Listing: AWS GPU infrastructure deployment
# Creating the GPU-enabled infrastructure resources

# Execute the deployment plan
terraform apply tfplan
terraform apply
yes

# Capture and display outputs
terraform output

# List our EC2 instances
aws ec2 describe-instances \
  --query 'Reservations[*].Instances[*].[InstanceId, InstanceType, Tags[?Key==`Name`]|[0].Value, State.Name]' \
  --output text

# Get our instance details - get only the first/latest instance ID
instance_id=$(aws ec2 describe-instances \
  --filters "Name=tag:Name,Values=EC2-RagFlow-GPU" "Name=instance-state-name,Values=running,pending,stopping,stopped" \
  --query 'Reservations[*].Instances[*].[InstanceId]' \
  --output text | head -n1)
echo "Instance ID: $instance_id"


public_ip=$(aws ec2 describe-instances \
  --instance-ids "$instance_id" \
  --query 'Reservations[*].Instances[*].[PublicIpAddress]' \
  --output text)
echo "Public IP: $public_ip"
exit
#+end_src

*Result:* AWS GPU-enabled infrastructure is deployed and EC2 instance details are captured for subsequent configuration.

** SSH Configuration for Easy Access

This establishes convenient SSH access configuration and tests connectivity to the deployed GPU instance.

#+begin_src bash
# Listing: SSH configuration setup for GPU instance

pwd
# Test initial SSH connection
ssh -i ~/.ssh/ragflow-gpu_key ubuntu@"$public_ip" 'whoami && pwd'
yes
# Create SSH config entry for easy access
open ~/.ssh/config # we may delete an old entry first, manually
cat >> ~/.ssh/config << EOF
# SSH over EC2 - RagFlow GPU Project
Host EC2-RagFlow-GPU
    HostName $public_ip
    User ubuntu
    IdentityFile ~/.ssh/ragflow-gpu_key
EOF
## use a perl one-liner to grep these lines from the ssh-config file.
perl -nE 'print if /Host EC2-RagFlow-GPU/ .. /yesEOF/' ~/.ssh/config
#bbedit ~/.ssh/config

# Test SSH with hostname
ssh EC2-RagFlow-GPU 'whoami && date'

#+end_src

*Result:* SSH configuration is established and remote access to the GPU EC2 instance is verified.

** GPU Instance Selection and Upgrading

*** Recommended GPU EC2 Instance Types for RAG Workloads

Here is a list of recommended GPU-enabled EC2 instance types suitable for RAG workloads with RagFlow, focusing on instances with NVIDIA GPUs optimized for AI/ML tasks. All recommendations are for the ~eu-north-1~ region, with approximate on-demand pricing (as of late 2024)

| Instance Type | GPU | VRAM (GB) | vCPUs | RAM (GB) | Network Speed | Approx. Price/Hour (USD) | Notes |
|---------------|-----|-----------|-------|----------|---------------|---------------------------|-------|
| g4dn.xlarge  | 1x T4 | 16       | 4     | 16      | Up to 25 Gbps | $0.71                    | Good balance for moderate RAG workloads with GPU acceleration |
| g4dn.2xlarge | 1x T4 | 16       | 8     | 32      | Up to 25 Gbps | $1.05                    | More CPU/RAM for larger models |
| g5.xlarge    | 1x A10G | 24     | 4     | 16      | Up to 10 Gbps | $1.21                    | Latest generation with more VRAM |
| g6e.xlarge   | 1x L40S | 48     | 4     | 32      | Up to 20 Gbps | $1.22                    | High VRAM for large models |

**** Recommendations
- *For most RAG setups*: Start with ~g4dn.xlarge~ for a balance of GPU performance, memory, and cost.
- *For high-performance needs*: Opt for ~g5.xlarge~ or ~g6e.xlarge~ if you need more VRAM for larger models.
- *Considerations*: GPU instances are more expensive but provide significant performance improvements for embeddings and inference tasks.

*** Upgrading to a Different GPU Instance Type with Terraform

The best way to change your EC2 instance type is to update your Terraform configuration and apply the changes. 

#+begin_src bash
# Listing: Changing GPU instance type with Terraform

# Navigate to the Terraform GPU directory
cd "$PROJECT_DIR/terraform-gpu"

# Update the instance type in terraform.tfvars (replace 'g5.xlarge' with your desired type)
# or use an editor to change the instance type directly.
sed -i 's/instance_type    = "g4dn.xlarge"/instance_type    = "g5.xlarge"/g' terraform.tfvars

# Review the updated configuration
cat terraform.tfvars

# Generate and review the deployment plan
terraform plan -out=tfplan -var-file=terraform.tfvars

# Apply the changes to upgrade the instance
terraform apply tfplan

# Verify the instance has been upgraded
aws ec2 describe-instances \
  --filters "Name=tag:Name,Values=EC2-RagFlow-GPU" \
  --query 'Reservations[*].Instances[*].[InstanceType, State.Name]' \
  --output text
#+end_src

*Result:* GPU instance type has been successfully changed to the new configuration with updated GPU capabilities.

