private-rag-aws-gpu.html
<div id="outline-container-org4cf74ea" class="outline-3">
<h3 id="org4cf74ea"><span class="section-number-3">4.4.</span> Infrastructure Deployment Execution</h3>
<div class="outline-text-3" id="text-4-4">
<p>
This executes the Terraform plan to create the AWS infrastructure resources with GPU support.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: AWS GPU infrastructure deployment</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Creating the GPU-enabled infrastructure resources</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Execute the deployment plan</span>
terraform apply tfplan
terraform apply
yes

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Capture and display outputs</span>
terraform output

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">List our EC2 instances</span>
aws ec2 describe-instances <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceId, InstanceType, Tags[?Key==`Name`]|[0].Value, State.Name]'</span> <span style="color: #008000;">\</span>
  --output text

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Get our instance details - get only the first/latest instance ID</span>
<span style="color: #BA36A5;">instance_id</span>=$(aws ec2 describe-instances <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=tag:Name,Values=EC2-RagFlow-GPU"</span> <span style="color: #008000;">"Name=instance-state-name,Values=running,pending,stopping,stopped"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceId]'</span> <span style="color: #008000;">\</span>
  --output text | head -n1)
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Instance ID: $instance_id"</span>


<span style="color: #BA36A5;">public_ip</span>=$(aws ec2 describe-instances <span style="color: #008000;">\</span>
  --instance-ids <span style="color: #008000;">"$instance_id"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[PublicIpAddress]'</span> <span style="color: #008000;">\</span>
  --output text)
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Public IP: $public_ip"</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> AWS GPU-enabled infrastructure is deployed and EC2 instance details are captured for subsequent configuration.
</p>
</div>
</div>
<div id="outline-container-org7db99b9" class="outline-3">
<h3 id="org7db99b9"><span class="section-number-3">4.5.</span> SSH Configuration for Easy Access</h3>
<div class="outline-text-3" id="text-4-5">
<p>
This establishes convenient SSH access configuration and tests connectivity to the deployed GPU instance.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: SSH configuration setup for GPU instance</span>

<span style="color: #006FE0;">pwd</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test initial SSH connection</span>
ssh -i ~/.ssh/ragflow-gpu_key ubuntu@<span style="color: #008000;">"$public_ip"</span> <span style="color: #008000;">'whoami &amp;&amp; pwd'</span>
yes
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create SSH config entry for easy access</span>
open ~/.ssh/config <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">we may delete an old entry first, manually</span>
cat &gt;&gt; ~/.ssh/config &lt;&lt; EOF
<span style="color: #0000ff; background-color: #EEF5FE;"># SSH over EC2 - RagFlow GPU Project</span>
<span style="color: #0000ff; background-color: #EEF5FE;">Host EC2-RagFlow-GPU</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    HostName $public_ip</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    User ubuntu</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    IdentityFile ~/.ssh/ragflow-gpu_key</span>
<span style="color: #0000ff; background-color: #EEF5FE;">EOF</span>
<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">use a perl one-liner to grep these lines from the ssh-config file.</span>
perl -nE <span style="color: #008000;">'print if /Host EC2-RagFlow-GPU/ .. /yesEOF/'</span> ~/.ssh/config
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">bbedit ~/.ssh/config</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test SSH with hostname</span>
ssh EC2-RagFlow-GPU <span style="color: #008000;">'whoami &amp;&amp; date'</span>

</pre>
</div>

<p>
<b>Result:</b> SSH configuration is established and remote access to the GPU EC2 instance is verified.
</p>
</div>
</div>
<div id="outline-container-org510a74b" class="outline-3">
<h3 id="org510a74b"><span class="section-number-3">4.6.</span> GPU Instance Selection and Upgrading</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-org9fbcd5d" class="outline-4">
<h4 id="org9fbcd5d"><span class="section-number-4">4.6.1.</span> Recommended GPU EC2 Instance Types for RAG Workloads</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
Here is a list of recommended GPU-enabled EC2 instance types suitable for RAG workloads with RagFlow, focusing on instances with NVIDIA GPUs optimized for AI/ML tasks. All recommendations are for the <code>eu-north-1</code> region, with approximate on-demand pricing (as of late 2024)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Instance Type</th>
<th scope="col" class="org-left">GPU</th>
<th scope="col" class="org-right">VRAM (GB)</th>
<th scope="col" class="org-right">vCPUs</th>
<th scope="col" class="org-right">RAM (GB)</th>
<th scope="col" class="org-left">Network Speed</th>
<th scope="col" class="org-left">Approx. Price/Hour (USD)</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">g4dn.xlarge</td>
<td class="org-left">1x T4</td>
<td class="org-right">16</td>
<td class="org-right">4</td>
<td class="org-right">16</td>
<td class="org-left">Up to 25 Gbps</td>
<td class="org-left">$0.71</td>
<td class="org-left">Good balance for moderate RAG workloads with GPU acceleration</td>
</tr>

<tr>
<td class="org-left">g4dn.2xlarge</td>
<td class="org-left">1x T4</td>
<td class="org-right">16</td>
<td class="org-right">8</td>
<td class="org-right">32</td>
<td class="org-left">Up to 25 Gbps</td>
<td class="org-left">$1.05</td>
<td class="org-left">More CPU/RAM for larger models</td>
</tr>

<tr>
<td class="org-left">g5.xlarge</td>
<td class="org-left">1x A10G</td>
<td class="org-right">24</td>
<td class="org-right">4</td>
<td class="org-right">16</td>
<td class="org-left">Up to 10 Gbps</td>
<td class="org-left">$1.21</td>
<td class="org-left">Latest generation with more VRAM</td>
</tr>

<tr>
<td class="org-left">g6e.xlarge</td>
<td class="org-left">1x L40S</td>
<td class="org-right">48</td>
<td class="org-right">4</td>
<td class="org-right">32</td>
<td class="org-left">Up to 20 Gbps</td>
<td class="org-left">$1.22</td>
<td class="org-left">High VRAM for large models</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orgf6612ec" class="outline-5">
<h5 id="orgf6612ec"><span class="section-number-5">4.6.1.1.</span> Recommendations</h5>
<div class="outline-text-5" id="text-4-6-1-1">
<ul class="org-ul">
<li><b>For most RAG setups</b>: Start with <code>g4dn.xlarge</code> for a balance of GPU performance, memory, and cost.</li>
<li><b>For high-performance needs</b>: Opt for <code>g5.xlarge</code> or <code>g6e.xlarge</code> if you need more VRAM for larger models.</li>
<li><b>Considerations</b>: GPU instances are more expensive but provide significant performance improvements for embeddings and inference tasks.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd8d1d90" class="outline-4">
<h4 id="orgd8d1d90"><span class="section-number-4">4.6.2.</span> Upgrading to a Different GPU Instance Type with Terraform</h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
The best way to change your EC2 instance type is to update your Terraform configuration and apply the changes. 
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Changing GPU instance type with Terraform</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Navigate to the Terraform GPU directory</span>
<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform-gpu"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Update the instance type in terraform.tfvars (replace 'g5.xlarge' with your desired type)</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">or use an editor to change the instance type directly.</span>
sed -i <span style="color: #008000;">'s/instance_type    = "g4dn.xlarge"/instance_type    = "g5.xlarge"/g'</span> terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Review the updated configuration</span>
cat terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate and review the deployment plan</span>
terraform plan -out=tfplan -var-file=terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Apply the changes to upgrade the instance</span>
terraform apply tfplan

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the instance has been upgraded</span>
aws ec2 describe-instances <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=tag:Name,Values=EC2-RagFlow-GPU"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceType, State.Name]'</span> <span style="color: #008000;">\</span>
  --output text
</pre>
</div>

<p>
<b>Result:</b> GPU instance type has been successfully changed to the new configuration with updated GPU capabilities.
</p>
</div>
</div>
</div>
