private-rag-aws-gpu.org
** Summary

Infrastructure automation through Terraform provisions the AWS environment with GPU support. The EC2 instance operates with proper network security configuration and NVIDIA GPU capabilities. SSH access is established through dedicated keypairs. The infrastructure exists as version-controlled code, enabling consistent reproduction across deployments.

* GPU Verification

This verifies that the pre-installed GPU drivers, CUDA, and Docker GPU support are working correctly.

#+begin_src bash
# Listing: GPU verification
ssh EC2-RagFlow-GPU

# Installing NVIDIA monitoring tool nvitop
sudo apt update && sudo apt install -y pipx
pipx install nvitop

nvitop --version

# Check NVIDIA driver and GPU status
nvidia-smi

# Check CUDA version
nvcc --version

# Test GPU in Docker
docker run --rm --gpus all nvidia/cuda:12.9.0-base-ubuntu24.04 nvidia-smi

exit
#+end_src

*Result:* Pre-installed GPU drivers, CUDA toolkit, and Docker GPU support are verified as fully operational.

* Development Environment Setup

** Complete Docker Engine and Tools Installation

This establishes the complete development environment on the Ubuntu 24.04 GPU instance, including Docker Engine, container management tools, GitHub CLI, and Python development utilities.

*** Docker Engine Installation and Tools

Install Docker Engine with proper repository configuration and user permissions.

#+begin_src bash
# Listing: Docker Engine installation on GPU instance
# Setting up containerization platform for GPU-accelerated applications

ssh EC2-RagFlow-GPU

# Test Docker installation
docker run hello-world

# Verify Docker Compose
docker compose version

# Enable and Check Docker service to start on boot
sudo systemctl enable docker
sudo systemctl start docker
sudo systemctl status docker  --no-pager

# Install lazydocker for terminal-based Docker management
curl https://raw.githubusercontent.com/jesseduffield/lazydocker/master/scripts/install_update_linux.sh | bash
echo 'export PATH="$HOME/.local/bin:$PATH"' >> ~/.bashrc
source ~/.bashrc

lazydocker --version

# Install htop for system monitoring
sudo apt install -y htop
htop --version


exit

#+end_src

*Result:* Docker insallation is varified. Docker service is configured to start automatically on EC2 instance boot.
Lazydocker is installed and available in the PATH for terminal-based Docker management. The tool htop is also installed.

*** Python Development Tools Installation

Install uv (fast Python package installer) and development libraries required for Python projects.

#+begin_src bash
# Listing: Python development tools installation
# Installing uv and development dependencies

ssh EC2-RagFlow-GPU

# Install uv (fast Python package installer and runner)
curl -LsSf https://astral.sh/uv/install.sh | sh

# Verify uv installation
uv --version
uvx --version

# Install ICU development libraries and build tools
sudo apt update
sudo apt install -y \
    libicu-dev \
    pkg-config \
    build-essential

# Verify build tools
gcc --version
pkg-config --version

exit

#+end_src

*Result:* Python development tools including uv, ICU libraries, and build essentials are installed and verified.

*** Development Environment Summary

Verify the complete development environment is ready for deployment.
[Editors Note: Remove the echo statements in the this code block.]

#+begin_src bash
# Listing: Development environment verification

ssh EC2-RagFlow-GPU

# Display installed versions
docker --version
docker compose version
gh --version
uv --version
gcc --version | head -1
/usr/local/cuda/bin/nvcc --version | head -1
nvidia-smi --query-gpu=name --format=csv,noheader
uname -a
df -h /
nvidia-smi --query-gpu=memory.total --format=csv,noheader

exit

#+end_src

*Result:* Complete development environment with GPU support is verified and ready for RagFlow deployment and CI/CD operations.

** Summary

The development environment setup establishes necessary tools for containerized application deployment and CI/CD workflows on GPU-enabled infrastructure. Docker Engine provides the containerization platform, Lazydocker offers terminal management, and Python development tools support application requirements. CUDA and NVIDIA drivers enable GPU acceleration for enhanced performance.

* Core RagFlow Deployment

