private-rag-aws-gpu.html
<div id="outline-container-org30c8e7c" class="outline-3">
<h3 id="org30c8e7c"><span class="section-number-3">4.7.</span> Summary</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Infrastructure automation through Terraform provisions the AWS environment with GPU support. The EC2 instance operates with proper network security configuration and NVIDIA GPU capabilities. SSH access is established through dedicated keypairs. The infrastructure exists as version-controlled code, enabling consistent reproduction across deployments.
</p>
</div>
</div>
</div>
<div id="outline-container-org7ef261d" class="outline-2">
<h2 id="org7ef261d"><span class="section-number-2">5.</span> GPU Verification</h2>
<div class="outline-text-2" id="text-5">
<p>
This verifies that the pre-installed GPU drivers, CUDA, and Docker GPU support are working correctly.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: GPU verification</span>
ssh EC2-RagFlow-GPU

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing NVIDIA monitoring tool nvitop</span>
sudo apt update &amp;&amp; sudo apt install -y pipx
pipx install nvitop

nvitop --version

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check NVIDIA driver and GPU status</span>
nvidia-smi

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check CUDA version</span>
nvcc --version

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test GPU in Docker</span>
docker run --rm --gpus all nvidia/cuda:12.9.0-base-ubuntu24.04 nvidia-smi

<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> Pre-installed GPU drivers, CUDA toolkit, and Docker GPU support are verified as fully operational.
</p>
</div>
</div>
<div id="outline-container-org9abda6e" class="outline-2">
<h2 id="org9abda6e"><span class="section-number-2">6.</span> Development Environment Setup</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org6d86636" class="outline-3">
<h3 id="org6d86636"><span class="section-number-3">6.1.</span> Complete Docker Engine and Tools Installation</h3>
<div class="outline-text-3" id="text-6-1">
<p>
This establishes the complete development environment on the Ubuntu 24.04 GPU instance, including Docker Engine, container management tools, GitHub CLI, and Python development utilities.
</p>
</div>
<div id="outline-container-orgf0c4708" class="outline-4">
<h4 id="orgf0c4708"><span class="section-number-4">6.1.1.</span> Docker Engine Installation and Tools</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
Install Docker Engine with proper repository configuration and user permissions.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Docker Engine installation on GPU instance</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Setting up containerization platform for GPU-accelerated applications</span>

ssh EC2-RagFlow-GPU

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test Docker installation</span>
docker run hello-world

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify Docker Compose</span>
docker compose version

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Enable and Check Docker service to start on boot</span>
sudo systemctl enable docker
sudo systemctl start docker
sudo systemctl status docker  --no-pager

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install lazydocker for terminal-based Docker management</span>
curl https://raw.githubusercontent.com/jesseduffield/lazydocker/master/scripts/install_update_linux.sh | bash
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">'export PATH="$HOME/.local/bin:$PATH"'</span> &gt;&gt; ~/.bashrc
<span style="color: #006FE0;">source</span> ~/.bashrc

lazydocker --version

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install htop for system monitoring</span>
sudo apt install -y htop
htop --version


<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> Docker insallation is varified. Docker service is configured to start automatically on EC2 instance boot.
Lazydocker is installed and available in the PATH for terminal-based Docker management. The tool htop is also installed.
</p>
</div>
</div>
<div id="outline-container-org3f6c0f8" class="outline-4">
<h4 id="org3f6c0f8"><span class="section-number-4">6.1.2.</span> Python Development Tools Installation</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Install uv (fast Python package installer) and development libraries required for Python projects.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Python development tools installation</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing uv and development dependencies</span>

ssh EC2-RagFlow-GPU

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install uv (fast Python package installer and runner)</span>
curl -LsSf https://astral.sh/uv/install.sh | sh

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify uv installation</span>
uv --version
uvx --version

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install ICU development libraries and build tools</span>
sudo apt update
sudo apt install -y <span style="color: #008000;">\</span>
    libicu-dev <span style="color: #008000;">\</span>
    pkg-config <span style="color: #008000;">\</span>
    build-essential

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify build tools</span>
gcc --version
pkg-config --version

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> Python development tools including uv, ICU libraries, and build essentials are installed and verified.
</p>
</div>
</div>
<div id="outline-container-orgd9bb34e" class="outline-4">
<h4 id="orgd9bb34e"><span class="section-number-4">6.1.3.</span> Development Environment Summary</h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
Verify the complete development environment is ready for deployment.
[Editors Note: Remove the echo statements in the this code block.]
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Development environment verification</span>

ssh EC2-RagFlow-GPU

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Display installed versions</span>
docker --version
docker compose version
gh --version
uv --version
gcc --version | head -1
/usr/local/cuda/bin/nvcc --version | head -1
nvidia-smi --query-gpu=name --format=csv,noheader
uname -a
df -h /
nvidia-smi --query-gpu=memory.total --format=csv,noheader

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> Complete development environment with GPU support is verified and ready for RagFlow deployment and CI/CD operations.
</p>
</div>
</div>
</div>
<div id="outline-container-orgad58f50" class="outline-3">
<h3 id="orgad58f50"><span class="section-number-3">6.2.</span> Summary</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The development environment setup establishes necessary tools for containerized application deployment and CI/CD workflows on GPU-enabled infrastructure. Docker Engine provides the containerization platform, Lazydocker offers terminal management, and Python development tools support application requirements. CUDA and NVIDIA drivers enable GPU acceleration for enhanced performance.
</p>
</div>
</div>
</div>
<div id="outline-container-org852abf4" class="outline-2">
<h2 id="org852abf4"><span class="section-number-2">7.</span> Core RagFlow Deployment</h2>
<div class="outline-text-2" id="text-7">
</div>
