private-rag-aws-gpu.org
** Basic Ragflow Setup

This section deploys RagFlow on the GPU-enabled EC2 instance using Docker Compose following the QuickStart guide.

#+begin_src bash
# Listing: RagFlow deployment on GPU instance
# Installing and starting RagFlow RAG platform with GPU support

# SSH into the GPU EC2 instance
ssh EC2-RagFlow-GPU

# Clone the RagFlow repository
cd ~; pwd
git clone https://github.com/infiniflow/ragflow.git

# Navigate to the RagFlow directory
cd ~/ragflow/docker

# Update .env file to use GPU profile
sed -i 's/DEVICE=cpu/DEVICE=gpu/' .env
cat .env | grep DEVICE

# Upate docker-compose.yml to uncomment the executor service.
perl -i -pe 's/^  # /  / if /^  # /' docker/docker-compose.yml
   

# Start RagFlow using Docker Compose
docker compose up -d

# Verify the deployment
docker ps

# Getting SERVICE_IP
public_ip=$(curl -s http://checkip.amazonaws.com)
echo $public_ip

# RagFlow URL
echo "RagFlow is accessible at: http://$public_ip:80"

# Shutting down RagFlow (optional)
docker compose stop

exit
#+end_src

*Result:* RagFlow is successfully deployed and running on the GPU-enabled EC2 instance.

** HTTPS Setup with Self-Signed Certificate

This section provides step-by-step instructions for setting up HTTPS access to RAGFlow using a self-signed SSL certificate on the GPU instance.

**Prerequisites**

- Docker and Docker Compose installed on your GPU server
- Ports 80 and 443 open on your server
- Server's public IP address (replace <SERVER_IP> with your actual IP throughout these instructions)
- Basic knowledge of command-line operations

*** Step 1: Generate Self-Signed SSL Certificate**

Generate a self-signed certificate for your server's IP address.

#+begin_src bash
bash
pwd
ssh EC2-RagFlow-GPU
cd ~/ragflow/docker/nginx

# Retrieve the SERVER_IP
curl -s http://checkip.amazonaws.com
export SERVER_IP=$(curl -s http://checkip.amazonaws.com)
echo $SERVER_IP

# Create a directory for SSL certificates
mkdir -p ssl

# Generate a private key
openssl genrsa -out ssl/privkey.pem 2048

# Generate a certificate signing request (CSR) for localhost or your IP
openssl req -new -key ssl/privkey.pem -out ssl/cert.csr -subj "/C=US/ST=State/L=City/O=Organization/CN=localhost"
#openssl req -new -key ssl/privkey.pem -out ssl/cert.csr -subj "/C=US/ST=State/L=City/O=Organization/CN=$SERVER_IP"

# Generate the self-signed certificate valid for 365 days
openssl x509 -req -days 365 -in ssl/cert.csr -signkey ssl/privkey.pem -out ssl/fullchain.pem

# Set appropriate permissions
chmod 600 ssl/privkey.pem
chmod 644 ssl/fullchain.pem

# Verify the certificate was created
ls -la ssl/
cat ssl/fullchain.pem
cat ssl/privkey.pem
cat ssl/cert.csr

#+end_src

After running these commands, you should see the certificate files in the ssl directory.

*** Step 2: Modify Nginx Configuration**

Update the existing ragflow.https.conf file to use your IP address.

#+begin_src bash
# Go to the ragflow project directory
cd ~/ragflow
pwd

# Copy the existing HTTPS config as a backup
cp docker/nginx/ragflow.https.conf docker/nginx/ragflow.https.ip.conf

# Edit the configuration file to replace domain with IP and proxy path
sed -i "s/your-ragflow-domain.com/localhost/g" docker/nginx/ragflow.https.ip.conf
# For GPU version, use ragflow-gpu service
sed -i 's|http://ragflow:|http://ragflow-gpu:|' docker/nginx/ragflow.https.ip.conf

# Verify the changes
cat docker/nginx/ragflow.https.ip.conf
#+end_src

*** Step 3: Update Docker Compose Configuration

Modify the docker-compose.yml file to mount the self-signed certificates.

#+begin_src bash
pwd
cd ~/ragflow/docker

# Add certificate volumes to the ragflow service in docker-compose.yml
# Insert these lines under the existing volumes section for ragflow-cpu and ragflow-gpu services

# For ragflow-cpu service (around line 37-44):
# Add after: - ./entrypoint.sh:/ragflow/entrypoint.sh
      - ./nginx/ssl/fullchain.pem:/etc/nginx/ssl/fullchain.pem:ro
      - ./nginx/ssl/privkey.pem:/etc/nginx/ssl/privkey.pem:ro
      - ./nginx/ragflow.https.ip.conf:/etc/nginx/conf.d/ragflow.conf


# For ragflow-gpu service (around line 86-93):
# Add after: - ./entrypoint.sh:/ragflow/entrypoint.sh
      - ./nginx/ssl/fullchain.pem:/etc/nginx/ssl/fullchain.pem:ro
      - ./nginx/ssl/privkey.pem:/etc/nginx/ssl/privkey.pem:ro
      - ./nginx/ragflow.https.ip.conf:/etc/nginx/conf.d/ragflow.conf

# Verify the docker-compose.yml file syntax
docker compose config
#+end_src

*** Step 4: Restart RAGFlow Services

Stop the existing services and restart them with the new HTTPS configuration.

#+begin_src bash
ssh EC2-RagFlow-GPU

cd ~/ragflow/docker
pwd
# Stop all running services
docker compose down
docker compose stop

# Set the profile in .env and start (CPU or GPU)
docker compose  up -d

# Check that services are running
docker compose ps
docker compose exec ragflow-gpu date; pwd; ls -la

#+end_src

