private-rag-aws-gpu.html
<div id="outline-container-orgfdaf97f" class="outline-3">
<h3 id="orgfdaf97f"><span class="section-number-3">7.1.</span> Basic Ragflow Setup</h3>
<div class="outline-text-3" id="text-7-1">
<p>
This section deploys RagFlow on the GPU-enabled EC2 instance using Docker Compose following the QuickStart guide.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: RagFlow deployment on GPU instance</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing and starting RagFlow RAG platform with GPU support</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">SSH into the GPU EC2 instance</span>
ssh EC2-RagFlow-GPU

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Clone the RagFlow repository</span>
<span style="color: #006FE0;">cd</span> ~; <span style="color: #006FE0;">pwd</span>
git clone https://github.com/infiniflow/ragflow.git

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Navigate to the RagFlow directory</span>
<span style="color: #006FE0;">cd</span> ~/ragflow/docker

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Update .env file to use GPU profile</span>
sed -i <span style="color: #008000;">'s/DEVICE=cpu/DEVICE=gpu/'</span> .env
cat .env | grep DEVICE

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Upate docker-compose.yml to uncomment the executor service.</span>
perl -i -pe <span style="color: #008000;">'s/^  # /  / if /^  # /'</span> docker/docker-compose.yml


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Start RagFlow using Docker Compose</span>
docker compose up -d

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the deployment</span>
docker ps

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Getting SERVICE_IP</span>
<span style="color: #BA36A5;">public_ip</span>=$(curl -s http://checkip.amazonaws.com)
<span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">public_ip</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">RagFlow URL</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"RagFlow is accessible at: http://$public_ip:80"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Shutting down RagFlow (optional)</span>
docker compose stop

<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> RagFlow is successfully deployed and running on the GPU-enabled EC2 instance.
</p>
</div>
</div>
<div id="outline-container-org27bfe0d" class="outline-3">
<h3 id="org27bfe0d"><span class="section-number-3">7.2.</span> HTTPS Setup with Self-Signed Certificate</h3>
<div class="outline-text-3" id="text-7-2">
<p>
This section provides step-by-step instructions for setting up HTTPS access to RAGFlow using a self-signed SSL certificate on the GPU instance.
</p>

<p>
<b><b>Prerequisites</b></b>
</p>

<ul class="org-ul">
<li>Docker and Docker Compose installed on your GPU server</li>
<li>Ports 80 and 443 open on your server</li>
<li>Server's public IP address (replace &lt;SERVER<sub>IP</sub>&gt; with your actual IP throughout these instructions)</li>
<li>Basic knowledge of command-line operations</li>
</ul>
</div>
<div id="outline-container-org39644d2" class="outline-4">
<h4 id="org39644d2"><span class="section-number-4">7.2.1.</span> Step 1: Generate Self-Signed SSL Certificate**</h4>
<div class="outline-text-4" id="text-7-2-1">
<p>
Generate a self-signed certificate for your server's IP address.
</p>

<div class="org-src-container">
<pre class="src src-bash">bash
<span style="color: #006FE0;">pwd</span>
ssh EC2-RagFlow-GPU
<span style="color: #006FE0;">cd</span> ~/ragflow/docker/nginx

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Retrieve the SERVER_IP</span>
curl -s http://checkip.amazonaws.com
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">SERVER_IP</span>=$(curl -s http://checkip.amazonaws.com)
<span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">SERVER_IP</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create a directory for SSL certificates</span>
mkdir -p ssl

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate a private key</span>
openssl genrsa -out ssl/privkey.pem 2048

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate a certificate signing request (CSR) for localhost or your IP</span>
openssl req -new -key ssl/privkey.pem -out ssl/cert.csr -subj <span style="color: #008000;">"/C=US/ST=State/L=City/O=Organization/CN=localhost"</span>
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">openssl req -new -key ssl/privkey.pem -out ssl/cert.csr -subj "/C=US/ST=State/L=City/O=Organization/CN=$SERVER_IP"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate the self-signed certificate valid for 365 days</span>
openssl x509 -req -days 365 -in ssl/cert.csr -signkey ssl/privkey.pem -out ssl/fullchain.pem

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Set appropriate permissions</span>
chmod 600 ssl/privkey.pem
chmod 644 ssl/fullchain.pem

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the certificate was created</span>
ls -la ssl/
cat ssl/fullchain.pem
cat ssl/privkey.pem
cat ssl/cert.csr

</pre>
</div>

<p>
After running these commands, you should see the certificate files in the ssl directory.
</p>
</div>
</div>
<div id="outline-container-org3faa15f" class="outline-4">
<h4 id="org3faa15f"><span class="section-number-4">7.2.2.</span> Step 2: Modify Nginx Configuration**</h4>
<div class="outline-text-4" id="text-7-2-2">
<p>
Update the existing ragflow.https.conf file to use your IP address.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Go to the ragflow project directory</span>
<span style="color: #006FE0;">cd</span> ~/ragflow
<span style="color: #006FE0;">pwd</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Copy the existing HTTPS config as a backup</span>
cp docker/nginx/ragflow.https.conf docker/nginx/ragflow.https.ip.conf

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Edit the configuration file to replace domain with IP and proxy path</span>
sed -i <span style="color: #008000;">"s/your-ragflow-domain.com/localhost/g"</span> docker/nginx/ragflow.https.ip.conf
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For GPU version, use ragflow-gpu service</span>
sed -i <span style="color: #008000;">'s|http://ragflow:|http://ragflow-gpu:|'</span> docker/nginx/ragflow.https.ip.conf

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the changes</span>
cat docker/nginx/ragflow.https.ip.conf
</pre>
</div>
</div>
</div>
<div id="outline-container-org9fbfb2e" class="outline-4">
<h4 id="org9fbfb2e"><span class="section-number-4">7.2.3.</span> Step 3: Update Docker Compose Configuration</h4>
<div class="outline-text-4" id="text-7-2-3">
<p>
Modify the docker-compose.yml file to mount the self-signed certificates.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #006FE0;">pwd</span>
<span style="color: #006FE0;">cd</span> ~/ragflow/docker

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add certificate volumes to the ragflow service in docker-compose.yml</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Insert these lines under the existing volumes section for ragflow-cpu and ragflow-gpu services</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For ragflow-cpu service (around line 37-44):</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add after: - ./entrypoint.sh:/ragflow/entrypoint.sh</span>
      - ./nginx/ssl/fullchain.pem:/etc/nginx/ssl/fullchain.pem:ro
      - ./nginx/ssl/privkey.pem:/etc/nginx/ssl/privkey.pem:ro
      - ./nginx/ragflow.https.ip.conf:/etc/nginx/conf.d/ragflow.conf


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For ragflow-gpu service (around line 86-93):</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add after: - ./entrypoint.sh:/ragflow/entrypoint.sh</span>
      - ./nginx/ssl/fullchain.pem:/etc/nginx/ssl/fullchain.pem:ro
      - ./nginx/ssl/privkey.pem:/etc/nginx/ssl/privkey.pem:ro
      - ./nginx/ragflow.https.ip.conf:/etc/nginx/conf.d/ragflow.conf

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the docker-compose.yml file syntax</span>
docker compose config
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf3fa0bd" class="outline-4">
<h4 id="orgf3fa0bd"><span class="section-number-4">7.2.4.</span> Step 4: Restart RAGFlow Services</h4>
<div class="outline-text-4" id="text-7-2-4">
<p>
Stop the existing services and restart them with the new HTTPS configuration.
</p>

<div class="org-src-container">
<pre class="src src-bash">ssh EC2-RagFlow-GPU

<span style="color: #006FE0;">cd</span> ~/ragflow/docker
<span style="color: #006FE0;">pwd</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Stop all running services</span>
docker compose down
docker compose stop

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Set the profile in .env and start (CPU or GPU)</span>
docker compose  up -d

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check that services are running</span>
docker compose ps
docker compose exec ragflow-gpu date; <span style="color: #006FE0;">pwd</span>; ls -la

</pre>
</div>
</div>
</div>
