private-rag-aws-gpu.org
*** Step 5: Test HTTPS Access

Verify that the HTTPS setup is working correctly.

#+begin_src bash
# Listing: Testing HTTPS access to RagFlow

# Test HTTP to HTTPS redirect
curl -I http://$SERVER_IP

# Test HTTPS connection (ignore certificate warnings)
curl -k -I https://$SERVER_IP

# Check certificate details
openssl s_client -connect $SERVER_IP:443 -servername $SERVER_IP < /dev/null 2>/dev/null | openssl x509 -noout -dates -subject

# Verify RAGFlow API is accessible over HTTPS
curl -k https://$SERVER_IP/v1/system/healthz

# Test GPU functionality in running containers
docker compose exec ragflow-gpu nvidia-smi --query-gpu=name,memory.used,memory.total --format=csv

#+end_src

Ragflow URL is accessible at: 
- http://13.62.214.0/
- https://13.62.214.0/
  

** Use Case: Access RagFlow via SSH-Tunnel

This creates an SSH tunnel to access RagFlow securely from a local browser.

#+begin_src bash
# Listing: Testing RagFlow via SSH tunnel

ssh -L 9380:localhost:80 EC2-RagFlow-GPU
# Open RagFlow in your browser at http://localhost:9380
exit

#+end_src

When the SSH tunnel is established, RagFlow can be accessed via local browser at:
http://localhost:9380

*Result:* RagFlow is accessible via SSH tunnel and ready for document processing and RAG operations.

** Summary

RagFlow deployment establishes the core RAG platform with full GPU acceleration. The application uses GPU profile with optimized Docker Compose configuration, GPU resource limits, and CUDA environment variables for maximum performance. HTTPS setup with self-signed certificates and SSH tunnel access provide secure local browser connectivity. The GPU-enabled infrastructure delivers significant performance improvements for embeddings generation, vector similarity searches, and document processing operations.

* Advanced Features - Document Processing

** Document Ingestion and Processing

This demonstrates uploading and processing documents for RAG functionality with GPU acceleration.

*** Upload Documents

Access RagFlow via browser and upload sample documents for processing.

*** Configure Knowledge Base

Create a knowledge base and configure document parsing settings.

*** Test RAG Queries

Test retrieval-augmented generation with uploaded documents, leveraging GPU acceleration for faster processing.

** Summary

Document processing enables advanced knowledge management while preserving privacy. GPU acceleration provides enhanced performance for embeddings generation and vector similarity searches. Local processing handles sensitive documents without transmitting data to external services.

* Infrastructure Cleanup

Infrastructure as Code enables rapid deployment, but equally important is the ability to cleanly tear down resources to avoid unnecessary costs. This section provides procedures for complete cleanup of all deployed GPU resources.

** Stop RagFlow Services (Optional)

Before destroying infrastructure, gracefully stop all running services.

#+begin_src bash
# Listing: Stopping RagFlow services

ssh EC2-RagFlow-GPU

# Stop RagFlow Docker containers
cd ~/ragflow
docker compose --profile gpu down

# Verify containers are stopped
docker ps -a

# Optional: Remove Docker images to free disk space
docker system prune -a -f

# Exit SSH session
exit
#+end_src

*Result:* RagFlow services are stopped and Docker containers are removed from the GPU EC2 instance.

** Terminate GPU EC2 Instance with Terraform

Use Terraform to cleanly destroy all AWS infrastructure resources including the GPU instance.

#+begin_src bash
# Listing: Destroying AWS GPU infrastructure

cd "$PROJECT_DIR/terraform-gpu"
pwd
# Review what will be destroyed
terraform init
terraform plan -destroy -var-file=terraform.tfvars
# Destroy all infrastructure
terraform destroy -var-file=terraform.tfvars
yes

# Verify destruction
terraform show

# List remaining EC2 instances (should show none with EC2-RagFlow-GPU tag)
aws ec2 describe-instances \
  --filters "Name=tag:Name,Values=EC2-RagFlow-GPU" \
  --query 'Reservations[*].Instances[*].[InstanceId, State.Name]' \
  --output text
#+end_src

*Result:* All AWS GPU infrastructure resources are destroyed, including EC2 instance, security groups, and key pairs.

