private-rag-aws-gpu.html
<div id="outline-container-org8612421" class="outline-4">
<h4 id="org8612421"><span class="section-number-4">7.2.5.</span> Step 5: Test HTTPS Access</h4>
<div class="outline-text-4" id="text-7-2-5">
<p>
Verify that the HTTPS setup is working correctly.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Testing HTTPS access to RagFlow</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test HTTP to HTTPS redirect</span>
curl -I http://$<span style="color: #BA36A5;">SERVER_IP</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test HTTPS connection (ignore certificate warnings)</span>
curl -k -I https://$<span style="color: #BA36A5;">SERVER_IP</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check certificate details</span>
openssl s_client -connect $<span style="color: #BA36A5;">SERVER_IP</span>:443 -servername $<span style="color: #BA36A5;">SERVER_IP</span> &lt; /dev/null 2&gt;/dev/null | openssl x509 -noout -dates -subject

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify RAGFlow API is accessible over HTTPS</span>
curl -k https://$<span style="color: #BA36A5;">SERVER_IP</span>/v1/system/healthz

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test GPU functionality in running containers</span>
docker compose exec ragflow-gpu nvidia-smi --query-gpu=name,memory.used,memory.total --format=csv

</pre>
</div>

<p>
Ragflow URL is accessible at: 
</p>
<ul class="org-ul">
<li><a href="http://13.62.214.0/">http://13.62.214.0/</a></li>
<li><a href="https://13.62.214.0/">https://13.62.214.0/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbfa0956" class="outline-3">
<h3 id="orgbfa0956"><span class="section-number-3">7.3.</span> Use Case: Access RagFlow via SSH-Tunnel</h3>
<div class="outline-text-3" id="text-7-3">
<p>
This creates an SSH tunnel to access RagFlow securely from a local browser.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Testing RagFlow via SSH tunnel</span>

ssh -L 9380:localhost:80 EC2-RagFlow-GPU
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Open RagFlow in your browser at http://localhost:9380</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
When the SSH tunnel is established, RagFlow can be accessed via local browser at:
<a href="http://localhost:9380">http://localhost:9380</a>
</p>

<p>
<b>Result:</b> RagFlow is accessible via SSH tunnel and ready for document processing and RAG operations.
</p>
</div>
</div>
<div id="outline-container-org0adc4f3" class="outline-3">
<h3 id="org0adc4f3"><span class="section-number-3">7.4.</span> Summary</h3>
<div class="outline-text-3" id="text-7-4">
<p>
RagFlow deployment establishes the core RAG platform with full GPU acceleration. The application uses GPU profile with optimized Docker Compose configuration, GPU resource limits, and CUDA environment variables for maximum performance. HTTPS setup with self-signed certificates and SSH tunnel access provide secure local browser connectivity. The GPU-enabled infrastructure delivers significant performance improvements for embeddings generation, vector similarity searches, and document processing operations.
</p>
</div>
</div>
</div>
<div id="outline-container-org38c17d4" class="outline-2">
<h2 id="org38c17d4"><span class="section-number-2">8.</span> Advanced Features - Document Processing</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org75ea563" class="outline-3">
<h3 id="org75ea563"><span class="section-number-3">8.1.</span> Document Ingestion and Processing</h3>
<div class="outline-text-3" id="text-8-1">
<p>
This demonstrates uploading and processing documents for RAG functionality with GPU acceleration.
</p>
</div>
<div id="outline-container-org75ba70b" class="outline-4">
<h4 id="org75ba70b"><span class="section-number-4">8.1.1.</span> Upload Documents</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
Access RagFlow via browser and upload sample documents for processing.
</p>
</div>
</div>
<div id="outline-container-org527ec3a" class="outline-4">
<h4 id="org527ec3a"><span class="section-number-4">8.1.2.</span> Configure Knowledge Base</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
Create a knowledge base and configure document parsing settings.
</p>
</div>
</div>
<div id="outline-container-org1952bda" class="outline-4">
<h4 id="org1952bda"><span class="section-number-4">8.1.3.</span> Test RAG Queries</h4>
<div class="outline-text-4" id="text-8-1-3">
<p>
Test retrieval-augmented generation with uploaded documents, leveraging GPU acceleration for faster processing.
</p>
</div>
</div>
</div>
<div id="outline-container-org6e8685d" class="outline-3">
<h3 id="org6e8685d"><span class="section-number-3">8.2.</span> Summary</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Document processing enables advanced knowledge management while preserving privacy. GPU acceleration provides enhanced performance for embeddings generation and vector similarity searches. Local processing handles sensitive documents without transmitting data to external services.
</p>
</div>
</div>
</div>
<div id="outline-container-org123bb69" class="outline-2">
<h2 id="org123bb69"><span class="section-number-2">9.</span> Infrastructure Cleanup</h2>
<div class="outline-text-2" id="text-9">
<p>
Infrastructure as Code enables rapid deployment, but equally important is the ability to cleanly tear down resources to avoid unnecessary costs. This section provides procedures for complete cleanup of all deployed GPU resources.
</p>
</div>
<div id="outline-container-org6135eba" class="outline-3">
<h3 id="org6135eba"><span class="section-number-3">9.1.</span> Stop RagFlow Services (Optional)</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Before destroying infrastructure, gracefully stop all running services.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Stopping RagFlow services</span>

ssh EC2-RagFlow-GPU

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Stop RagFlow Docker containers</span>
<span style="color: #006FE0;">cd</span> ~/ragflow
docker compose --profile gpu down

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify containers are stopped</span>
docker ps -a

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Optional: Remove Docker images to free disk space</span>
docker system prune -a -f

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Exit SSH session</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> RagFlow services are stopped and Docker containers are removed from the GPU EC2 instance.
</p>
</div>
</div>
<div id="outline-container-org68975c9" class="outline-3">
<h3 id="org68975c9"><span class="section-number-3">9.2.</span> Terminate GPU EC2 Instance with Terraform</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Use Terraform to cleanly destroy all AWS infrastructure resources including the GPU instance.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Destroying AWS GPU infrastructure</span>

<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform-gpu"</span>
<span style="color: #006FE0;">pwd</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Review what will be destroyed</span>
terraform init
terraform plan -destroy -var-file=terraform.tfvars
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Destroy all infrastructure</span>
terraform destroy -var-file=terraform.tfvars
yes

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify destruction</span>
terraform show

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">List remaining EC2 instances (should show none with EC2-RagFlow-GPU tag)</span>
aws ec2 describe-instances <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=tag:Name,Values=EC2-RagFlow-GPU"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceId, State.Name]'</span> <span style="color: #008000;">\</span>
  --output text
</pre>
</div>

<p>
<b>Result:</b> All AWS GPU infrastructure resources are destroyed, including EC2 instance, security groups, and key pairs.
</p>
</div>
</div>
