private-rag-aws-gpu.org
** Clean Up Local SSH Configuration

Remove SSH configurations and keys associated with the destroyed GPU instance.

#+begin_src bash
# Listing: Removing local SSH configuration
# Cleaning up SSH keys and config entries

# Remove SSH config entry for EC2-RagFlow-GPU
# Manual edit recommended to preserve other configurations
echo "Removing SSH config entry for EC2-RagFlow-GPU..."
perl -i.bak -ne 'print unless /^Host EC2-RagFlow-GPU$/..(/^Host / && !/^Host EC2-RagFlow-GPU$/)' ~/.ssh/config

# Verify removal
grep -A 5 "EC2-RagFlow-GPU" ~/.ssh/config || echo "SSH config entry removed successfully"

# Optional: Remove SSH keys (only if no longer needed)
# Uncomment the following lines if you want to delete the keys:
rm -f ~/.ssh/ragflow-gpu_key
rm -f ~/.ssh/ragflow-gpu_key.pub

# List remaining SSH keys
ls -la ~/.ssh/ragflow-gpu_key*

#+end_src

*Result:* SSH configuration entries are removed. SSH keys remain available for potential future deployments (remove manually if no longer needed).

** Clean Up Terraform State Files

Clean up Terraform state and temporary files.

#+begin_src bash
# Listing: Cleaning up Terraform files
# Removing state and temporary files
pwd
cd "$PROJECT_DIR/terraform-gpu"

# List Terraform state files
ls -la terraform.tfstate*

# Optional: Back up state files before removal
mkdir -p ../terraform-gpu-backups
cp terraform.tfstate* ../terraform-gpu-backups/ 2>/dev/null || echo "No state files to backup"

# Remove Terraform state files (only after infrastructure is destroyed)
rm -f terraform.tfstate
rm -f terraform.tfstate.backup
rm -f tfplan*
rm -f terraform.tfvars

# Clean up Terraform cache
rm -rf .terraform

# Verify cleanup
pwd
ls -la
#+end_src

*Result:* Terraform state files and temporary files are removed to complete the cleanup process.

** Verify Complete Cleanup

Perform final verification that all resources have been removed.

#+begin_src bash
# Listing: Final cleanup verification
# Confirming all resources are removed

# Check for any remaining EC2 instances
aws ec2 describe-instances \
  --filters "Name=tag:project,Values=ragflow-gpu" \
  --query 'Reservations[*].Instances[*].[InstanceId, State.Name, Tags[?Key==`Name`]|[0].Value]' \
  --output table

# Check for remaining security groups
aws ec2 describe-security-groups \
  --filters "Name=group-name,Values=RagFlowGPUSecurityGroup" \
  --query 'SecurityGroups[*].[GroupId, GroupName]' \
  --output table

# Check for remaining key pairs
aws ec2 describe-key-pairs \
  --filters "Name=key-name,Values=ragflow-gpu-key" \
  --query 'KeyPairs[*].[KeyName, KeyFingerprint]' \
  --output table

#  "Cleanup Verification Complete"
#+end_src

*Result:* Final verification confirms all AWS GPU resources have been properly cleaned up and removed.

** Summary

Infrastructure cleanup procedures remove all deployed GPU resources. Terraform destroy commands remove AWS infrastructure, SSH configurations clean from local systems, and verification steps confirm proper resource removal. This prevents unexpected costs after project completion.

This project demonstrates that privacy-focused RAG systems are both technically feasible and practically deployable with optimized GPU acceleration using Ubuntu 24.04 and pre-configured Deep Learning AMIs. The GPU profile configuration, CUDA environment variables, and Docker resource limits ensure maximum performance for embeddings generation and vector operations. Self-hosted solutions provide alternatives to cloud-only AI services while delivering enterprise-grade GPU performance for enhanced RAG capabilities.

---

*This completes the RagFlow AWS GPU deployment using live-scripting methodology. Each code block is executable with F4 in Emacs using `send-line-to-vterm`, or can be copied and pasted into any terminal for the same results.*


