private-rag-aws-gpu.html
<div id="outline-container-orge40dac1" class="outline-3">
<h3 id="orge40dac1"><span class="section-number-3">9.3.</span> Clean Up Local SSH Configuration</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Remove SSH configurations and keys associated with the destroyed GPU instance.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Removing local SSH configuration</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Cleaning up SSH keys and config entries</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Remove SSH config entry for EC2-RagFlow-GPU</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Manual edit recommended to preserve other configurations</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Removing SSH config entry for EC2-RagFlow-GPU..."</span>
perl -i.bak -ne <span style="color: #008000;">'print unless /^Host EC2-RagFlow-GPU$/..(/^Host / &amp;&amp; !/^Host EC2-RagFlow-GPU$/)'</span> ~/.ssh/config

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify removal</span>
grep -A 5 <span style="color: #008000;">"EC2-RagFlow-GPU"</span> ~/.ssh/config || <span style="color: #006FE0;">echo</span> <span style="color: #008000;">"SSH config entry removed successfully"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Optional: Remove SSH keys (only if no longer needed)</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Uncomment the following lines if you want to delete the keys:</span>
rm -f ~/.ssh/ragflow-gpu_key
rm -f ~/.ssh/ragflow-gpu_key.pub

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">List remaining SSH keys</span>
ls -la ~/.ssh/ragflow-gpu_key*

</pre>
</div>

<p>
<b>Result:</b> SSH configuration entries are removed. SSH keys remain available for potential future deployments (remove manually if no longer needed).
</p>
</div>
</div>
<div id="outline-container-org9c8c201" class="outline-3">
<h3 id="org9c8c201"><span class="section-number-3">9.4.</span> Clean Up Terraform State Files</h3>
<div class="outline-text-3" id="text-9-4">
<p>
Clean up Terraform state and temporary files.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Cleaning up Terraform files</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Removing state and temporary files</span>
<span style="color: #006FE0;">pwd</span>
<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform-gpu"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">List Terraform state files</span>
ls -la terraform.tfstate*

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Optional: Back up state files before removal</span>
mkdir -p ../terraform-gpu-backups
cp terraform.tfstate* ../terraform-gpu-backups/ 2&gt;/dev/null || <span style="color: #006FE0;">echo</span> <span style="color: #008000;">"No state files to backup"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Remove Terraform state files (only after infrastructure is destroyed)</span>
rm -f terraform.tfstate
rm -f terraform.tfstate.backup
rm -f tfplan*
rm -f terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Clean up Terraform cache</span>
rm -rf .terraform

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify cleanup</span>
<span style="color: #006FE0;">pwd</span>
ls -la
</pre>
</div>

<p>
<b>Result:</b> Terraform state files and temporary files are removed to complete the cleanup process.
</p>
</div>
</div>
<div id="outline-container-orgfce4a6f" class="outline-3">
<h3 id="orgfce4a6f"><span class="section-number-3">9.5.</span> Verify Complete Cleanup</h3>
<div class="outline-text-3" id="text-9-5">
<p>
Perform final verification that all resources have been removed.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Final cleanup verification</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Confirming all resources are removed</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check for any remaining EC2 instances</span>
aws ec2 describe-instances <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=tag:project,Values=ragflow-gpu"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceId, State.Name, Tags[?Key==`Name`]|[0].Value]'</span> <span style="color: #008000;">\</span>
  --output table

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check for remaining security groups</span>
aws ec2 describe-security-groups <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=group-name,Values=RagFlowGPUSecurityGroup"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'SecurityGroups[*].[GroupId, GroupName]'</span> <span style="color: #008000;">\</span>
  --output table

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check for remaining key pairs</span>
aws ec2 describe-key-pairs <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=key-name,Values=ragflow-gpu-key"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'KeyPairs[*].[KeyName, KeyFingerprint]'</span> <span style="color: #008000;">\</span>
  --output table

<span style="color: #8D8D84;">#  </span><span style="color: #8D8D84; font-style: italic;">"Cleanup Verification Complete"</span>
</pre>
</div>

<p>
<b>Result:</b> Final verification confirms all AWS GPU resources have been properly cleaned up and removed.
</p>
</div>
</div>
<div id="outline-container-orgd064333" class="outline-3">
<h3 id="orgd064333"><span class="section-number-3">9.6.</span> Summary</h3>
<div class="outline-text-3" id="text-9-6">
<p>
Infrastructure cleanup procedures remove all deployed GPU resources. Terraform destroy commands remove AWS infrastructure, SSH configurations clean from local systems, and verification steps confirm proper resource removal. This prevents unexpected costs after project completion.
</p>

<p>
This project demonstrates that privacy-focused RAG systems are both technically feasible and practically deployable with optimized GPU acceleration using Ubuntu 24.04 and pre-configured Deep Learning AMIs. The GPU profile configuration, CUDA environment variables, and Docker resource limits ensure maximum performance for embeddings generation and vector operations. Self-hosted solutions provide alternatives to cloud-only AI services while delivering enterprise-grade GPU performance for enhanced RAG capabilities.
</p>

<p>
&#x2014;
</p>

<p>
<b>This completes the RagFlow AWS GPU deployment using live-scripting methodology. Each code block is executable with F4 in Emacs using `send-line-to-vterm`, or can be copied and pasted into any terminal for the same results.</b>
</p>
</div>
</div>
</div>
