private-rag-aws-gpu.html
<div id="outline-container-org37103f2" class="outline-2">
<h2 id="org37103f2"><span class="section-number-2">10.</span> Appendix: Live-Cycle Operations</h2>
<div class="outline-text-2" id="text-10">
<p>
This section provides procedures for managing the GPU EC2 instance lifecycle - starting and stopping the instance when returning to work sessions after periods of inactivity.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #0000FF; font-weight: bold;">exit</span>

bash
<span style="color: #006FE0;">pwd</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Initialize project environment</span>
<span style="color: #BA36A5;">PROJECT_DIR</span>=<span style="color: #008000;">"~/$(whoami)/Labs/private-rag"</span>
<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR"</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">AWS_PROFILE</span>=lab-a-north

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Get instance ID and filter out terminated instances if needed</span>
<span style="color: #BA36A5;">instance_id</span>=$(aws ec2 describe-instances --filters <span style="color: #008000;">"Name=tag:Name,Values=EC2-RagFlow-GPU"</span> <span style="color: #008000;">"Name=instance-state-name,Values=running,pending,stopping,stopped"</span> --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceId]'</span> --output text | head -n1)
<span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">instance_id</span>

<span style="color: #8D8D84;">### </span><span style="color: #8D8D84; font-style: italic;">STATUS: Get current instance state</span>
aws ec2 describe-instances --instance-ids <span style="color: #008000;">"$instance_id"</span> --query <span style="color: #008000;">'Reservations[*].Instances[*].[State.Name]'</span> --output text

<span style="color: #8D8D84;">### </span><span style="color: #8D8D84; font-style: italic;">START:  Start and wait for running state</span>
aws ec2 start-instances --instance-ids <span style="color: #008000;">"$instance_id"</span>
<span style="color: #0000FF; font-weight: bold;">while</span> [ <span style="color: #008000;">"$(aws ec2 describe-instances --instance-ids "$instance_id" --query "Reservations[0].Instances[0].State.Name" --output text)"</span> != <span style="color: #008000;">"running"</span> ]; <span style="color: #0000FF; font-weight: bold;">do </span><span style="color: #006FE0;">echo</span> -n <span style="color: #008000;">"."</span>; sleep 1; <span style="color: #0000FF; font-weight: bold;">done</span>; <span style="color: #006FE0;">echo</span> <span style="color: #008000;">" &#9989; running"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Get public IP</span>
<span style="color: #BA36A5;">public_ip</span>=$(aws ec2 describe-instances --instance-ids <span style="color: #008000;">"$instance_id"</span> --query <span style="color: #008000;">'Reservations[*].Instances[*].[PublicIpAddress]'</span> --output text)
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Instance running at: $public_ip"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test SSH connection with timeout of 10 seconds</span>
ssh EC2-RagFlow-GPU -v -o <span style="color: #BA36A5;">ConnectTimeout</span>=10 <span style="color: #008000;">'whoami &amp;&amp; date &amp;&amp; uptime'</span>
ssh EC2-RagFlow-GPU <span style="color: #008000;">'whoami &amp;&amp; date &amp;&amp; uptime'</span>

<span style="color: #8D8D84;">### </span><span style="color: #8D8D84; font-style: italic;">STOP: stop  the instance and wait for stopped state</span>
aws ec2 stop-instances --instance-ids <span style="color: #008000;">"$instance_id"</span>
<span style="color: #0000FF; font-weight: bold;">while</span> [ <span style="color: #008000;">"$(aws ec2 describe-instances --instance-ids "$instance_id" --query "Reservations[0].Instances[0].State.Name" --output text)"</span> != <span style="color: #008000;">"stopped"</span> ]; <span style="color: #0000FF; font-weight: bold;">do </span><span style="color: #006FE0;">echo</span> -n <span style="color: #008000;">"."</span>; sleep 1; <span style="color: #0000FF; font-weight: bold;">done</span>; <span style="color: #006FE0;">echo</span> <span style="color: #008000;">" &#9989; stopped"</span>

</pre>
</div>

<p>
<b>Result:</b> GPU EC2 instance  started and ready for use. Stop commands are provided as well.
</p>
</div>
</div>
<div id="outline-container-orgce90ced" class="outline-2">
<h2 id="orgce90ced"><span class="section-number-2">11.</span> End</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-11-18</p>
<p class="author">Author: Andreas Wittmann</p>
<p class="date">Created: 2025-11-20 Thu 20:30</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
